Add unit and integrate services and add Readme.md and Architecture.md
